In [29]:
from socceraction.data.wyscout import PublicWyscoutLoader
from socceraction.spadl.wyscout import convert_to_actions

In [30]:
api = PublicWyscoutLoader(root="data/wyscout")

In [31]:
# Competitions Input
competitions_df = api.competitions()
competitions_df.head()

,competition_id,season_id,country_name,competition_name,competition_gender,season_name
0,524,181248,Italy,Italian first division,male,2017/2018
1,364,181150,England,English first division,male,2017/2018
2,795,181144,Spain,Spanish first division,male,2017/2018
3,412,181189,France,French first division,male,2017/2018
4,426,181137,Germany,German first division,male,2017/2018

In [32]:
# Games Input (Competition_id, Season_id)
games_england_df = api.games(364, 181150)
games_england_df.tail()

,game_id,competition_id,season_id,game_date,game_day,home_team_id,away_team_id
375,2499723,364,181150,2017-08-12 14:00:00,1,1623,1639
376,2499726,364,181150,2017-08-12 14:00:00,1,1619,10531
377,2499728,364,181150,2017-08-12 14:00:00,1,1627,1659
378,2499727,364,181150,2017-08-12 11:30:00,1,1644,1612
379,2499719,364,181150,2017-08-11 18:45:00,1,1609,1631

In [33]:
# Teams Input (game_id)
teams_england_df = api.teams(2499726)
teams_england_df.head()

   team_id team_name_short         team_name
0    10531    Swansea City  Swansea City AFC
1     1619     Southampton    Southampton FC

In [34]:
# Events Input (game_id)
event_england_df = api.events(2499726)
event_england_df.tail()

,event_id,game_id,period_id,milliseconds,team_id,player_id,type_id,type_name,subtype_id,subtype_name,positions,tags
1588,178220226,2499726,2,2874007.513,1619,703,1,Duel,12,Ground defending duel,"[{'y': 13, 'x': 27}, {'y': 7, 'x': 26}]","[{'id': 601}, {'id': 703}, {'id': 1801}]"
1589,178220336,2499726,2,2874053.213,10531,25571,1,Duel,11,Ground attacking duel,"[{'y': 87, 'x': 73}, {'y': 93, 'x': 74}]","[{'id': 602}, {'id': 701}, {'id': 1802}]"
1590,178220227,2499726,2,2876530.851,1619,703,8,Pass,83,High pass,"[{'y': 7, 'x': 26}, {'y': 33, 'x': 70}]",[{'id': 1801}]
1591,178220337,2499726,2,2879079.802,10531,61979,1,Duel,10,Air duel,"[{'y': 67, 'x': 30}, {'y': 100, 'x': 100}]","[{'id': 703}, {'id': 1801}]"
1592,178220228,2499726,2,2879177.502,1619,8116,1,Duel,10,Air duel,"[{'y': 33, 'x': 70}, {'y': 0, 'x': 0}]","[{'id': 701}, {'id': 1802}]"

In [38]:
# Convert Wyscout to SPADL Format 
spadl_events_england_df = convert_to_actions(event_england_df, 1619)
spadl_events_england_df.head()

,game_id,period_id,time_seconds,team_id,player_id,start_x,start_y,end_x,end_y,original_event_id,bodypart_id,type_id,result_id,action_id
0,2499726,1,0.506969,10531,77557,53.55,34.68,73.5,33.32,178218751,0,0,1,0
1,2499726,1,2.281237,10531,77550,73.50,33.32,73.5,19.04,178218752,0,0,1,1
2,2499726,1,4.066574,10531,246866,73.50,19.04,79.8,48.28,178218753,0,0,1,2
3,2499726,1,6.515098,10531,21164,79.80,48.28,71.4,65.28,178218754,0,0,1,3
4,2499726,1,8.587495,10531,8336,71.40,65.28,65.1,50.32,178218755,0,0,0,4